SMALL ANAYLSIS OF STUDENT DATA

In [113]:
import pandas as pd

In [114]:
dict = {"Name":["Somesh Chourasia","Ajita Mishra","Shivam Raj","Shivni Mishra","Manas Chourasia","Ajit Doval","Aman Mishra"],
"Rollnumber": [221,222,223,224,225,226,227],
"Grade" : ("A","B","B","C","F","E","A"),
"Gender": ["male","female","male","female","male","male","male"]}

In [115]:
data = pd.DataFrame(dict)
data

               Name  Rollnumber Grade  Gender
0  Somesh Chourasia         221     A    male
1      Ajita Mishra         222     B  female
2        Shivam Raj         223     B    male
3     Shivni Mishra         224     C  female
4   Manas Chourasia         225     F    male
5        Ajit Doval         226     E    male
6       Aman Mishra         227     A    male

TOP  VALUE

In [116]:
data.head(1)

               Name  Rollnumber Grade Gender
0  Somesh Chourasia         221     A   male

DOWN VALUE

In [117]:
data.tail(1)

          Name  Rollnumber Grade Gender
6  Aman Mishra         227     A   male

shape of dataset

In [118]:
data.shape

(7, 4)

total row in data set

In [119]:
print("tortal number of row : " , data.shape[0])

tortal number of row :  7

total  number of column

In [120]:
print("total number of column : ",data.shape[1])

total number of column :  4

now we know about the dataset

In [121]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        7 non-null      object
 1   Rollnumber  7 non-null      int64
 2   Grade       7 non-null      object
 3   Gender      7 non-null      object
dtypes: int64(1), object(3)
memory usage: 356.0+ bytes

NOW WE I'LL CHECK IS THERE ANY NULL VALUE OR NOT

In [122]:
data.isnull()

    Name  Rollnumber  Grade  Gender
0  False       False  False   False
1  False       False  False   False
2  False       False  False   False
3  False       False  False   False
4  False       False  False   False
5  False       False  False   False
6  False       False  False   False

count of null

In [123]:
print("number of null values : ")
print(data.isnull().sum(axis= 1 ))
#by (axis = 0) you can check the column null values 
#by (axis = 1)you can check the row null values

number of null values :
0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

get all about statistics in just one command

In [124]:
data.describe()
#here is only single numerical column but we can include other column also for data analysis

       Rollnumber
count    7.000000
mean   224.000000
std      2.160247
min    221.000000
25%    222.500000
50%    224.000000
75%    225.500000
max    227.000000

In [125]:
data.describe(include = 'all')

                    Name  Rollnumber Grade Gender
count                  7    7.000000     7      7
unique                 7         NaN     5      2
top     Somesh Chourasia         NaN     A   male
freq                   1         NaN     2      5
mean                 NaN  224.000000   NaN    NaN
std                  NaN    2.160247   NaN    NaN
min                  NaN  221.000000   NaN    NaN
25%                  NaN  222.500000   NaN    NaN
50%                  NaN  224.000000   NaN    NaN
75%                  NaN  225.500000   NaN    NaN
max                  NaN  227.000000   NaN    NaN

unique value of any column

In [126]:
data['Grade'].unique()
print("unique name")
data['Name'].unique()

unique name

array(['Somesh Chourasia', 'Ajita Mishra', 'Shivam Raj', 'Shivni Mishra',
       'Manas Chourasia', 'Ajit Doval', 'Aman Mishra'], dtype=object)

if you wanna find number of the unique values

In [127]:
data['Grade'].nunique()
#if you not define specific name it'll return all unique value

5

we also can count the values which are inside the column

In [128]:
data['Grade'].value_counts()

Grade
A    2
B    2
C    1
F    1
E    1
Name: count, dtype: int64

TO FINF BETWEEN THINGS

In [129]:
data[data['Rollnumber']>221]

              Name  Rollnumber Grade  Gender
1     Ajita Mishra         222     B  female
2       Shivam Raj         223     B    male
3    Shivni Mishra         224     C  female
4  Manas Chourasia         225     F    male
5       Ajit Doval         226     E    male
6      Aman Mishra         227     A    male

In [130]:
data[(data['Rollnumber']>224) & (data['Rollnumber']<227)]

              Name  Rollnumber Grade Gender
4  Manas Chourasia         225     F   male
5       Ajit Doval         226     E   male

count the numbers betweeen the values

In [131]:
len(data[(data['Rollnumber']>224) & (data['Rollnumber']<227)])

2

In [132]:
data['Rollnumber'].between(224,227)

0    False
1    False
2    False
3     True
4     True
5     True
6     True
Name: Rollnumber, dtype: bool

finding mean and median

In [133]:
print("the mean of the roll nnumbers",data['Rollnumber'].mean())
print("the median of classs Grade",data['Rollnumber'].median())

the mean of the roll nnumbers 224.0
the median of classs Grade 224.0

Apply method

In [134]:
def grade(x):
    if x == 'A':
        return "Superb"
    elif x == 'B':
        return "good"
    elif x == 'C':
        return "not bad"
    else:
        return "better luck next time"

In [135]:
data['review'] = data["Grade"].apply(grade)
print(data['review'])

0                   Superb
1                     good
2                     good
3                  not bad
4    better luck next time
5    better luck next time
6                   Superb
Name: review, dtype: object

encoding using map function

In [138]:
data['male_female'] = data['Gender'].map({"male":1,"female":0})
data

,Name,Rollnumber,Grade,Gender,review,male_female
0,Somesh Chourasia,221,A,male,Superb,1
1,Ajita Mishra,222,B,female,good,0
2,Shivam Raj,223,B,male,good,1
3,Shivni Mishra,224,C,female,not bad,0
4,Manas Chourasia,225,F,male,better luck next time,1
5,Ajit Doval,226,E,male,better luck next time,1
6,Aman Mishra,227,A,male,Superb,1

droping columns

In [139]:
data.drop(['male_female','review'],axis= 1 ,inplace= True)

In [140]:
data

               Name  Rollnumber Grade  Gender
0  Somesh Chourasia         221     A    male
1      Ajita Mishra         222     B  female
2        Shivam Raj         223     B    male
3     Shivni Mishra         224     C  female
4   Manas Chourasia         225     F    male
5        Ajit Doval         226     E    male
6       Aman Mishra         227     A    male

RETURNING THE COLUMNS AND ROWS OF THE DATA

In [141]:
data.columns

Index(['Name', 'Rollnumber', 'Grade', 'Gender'], dtype='object')

In [144]:
data.index

RangeIndex(start=0, stop=7, step=1)

Sorting data

In [146]:
data.sort_values(by = 'Grade',ascending= True)

               Name  Rollnumber Grade  Gender
0  Somesh Chourasia         221     A    male
6       Aman Mishra         227     A    male
1      Ajita Mishra         222     B  female
2        Shivam Raj         223     B    male
3     Shivni Mishra         224     C  female
5        Ajit Doval         226     E    male
4   Manas Chourasia         225     F    male

we have to display the name and marks only of girls

In [150]:
data[data['Gender'] == 'female']

            Name  Rollnumber Grade  Gender
1   Ajita Mishra         222     B  female
3  Shivni Mishra         224     C  female